---
type: BuildingPad
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 6
tags: [revit-api, class]
---

# BuildingPad

`Autodesk.Revit.DB.Architecture.BuildingPad` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2014 | `public static BuildingPad Create ( Document document , ElementId buildingPadTypeId , ElementId levelId , IList < CurveLoop > curveLoops )` |
| Method | GetBoundary | 2014 | `public IList < CurveLoop > GetBoundary ()` |
| Method | SetBoundary | 2014 | `public void SetBoundary ( IList < CurveLoop > curveLoops )` |
| Property | AssociatedTopographySurfaceId | 2015 | `public ElementId AssociatedTopographySurfaceId { get ; }` |
| Property | HostId | 2014 | `public ElementId HostId { get ; }` |
| Property | Parameter | — | `` |